diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВидДоговора КАК ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_Дата КАК ДатаДоговора,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_ПериодДействия КАК ПериодДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ОписаниеРабот КАК ОписаниеРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			Отказ = Истина;
			Сообщить("Выбран не правильный вид договора.");
			Прервать;
		КонецЕсли;
		Если Дата < Выборка.ДатаДоговора ИЛИ Дата > Выборка.ПериодДействияДоговора Тогда
			Отказ = Истина;
			Сообщить("Документ не входит во временные рамки договора.");
			Прервать;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Выборка.Клиент;
		Движение.Договор = Выборка.Договор;
		Движение.ОписаниеРабот = Выборка.ОписаниеРабот;
		Движение.Сумма = Выборка.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРаботы;
		Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ЭтоНовый() Тогда
		НоваяЗапись = Справочники.ВКМ_УведомленияТелеграм_боту.СоздатьЭлемент();
		НоваяЗапись.ТекстСообщения = СтрШаблон("<b>Новая заявка № %6 от %7 для %8!</b> Клиент: %1, Проблема: %2, Время проведения работ: %3 с %4 по %5.",
			Клиент.Наименование, ОписаниеПроблемы, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yy"), 
			Формат(ВремяНачалаРабот, "ДФ=HH:mm"), Формат(ВремяОкончанияРабот, "ДФ=HH:mm"), Номер, Дата, Специалист);
		НоваяЗапись.Записать();
	КонецЕсли;	
		
КонецПроцедуры          

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ЗаявкаИзменена = Ложь;
	Если ОписаниеПроблемы <> Ссылка.ОписаниеПроблемы Тогда
	   ЗаявкаИзменена = Истина;  
	   ИзмениласьПроблема = СтрШаблон("Изменилась проблема: %1.", ОписаниеПроблемы);
	КонецЕсли;
	
	Если Специалист <> Ссылка.Специалист Тогда
	   ЗаявкаИзменена = Истина;  
	   ИзменилсяСпециалист = СтрШаблон("Изменился специалист: %1 на %2.", Ссылка.Специалист, Специалист);
	КонецЕсли;
		
	Если ДатаПроведенияРабот <> Ссылка.ДатаПроведенияРабот ИЛИ ВремяНачалаРабот <> Ссылка.ВремяНачалаРабот ИЛИ ВремяОкончанияРабот <> Ссылка.ВремяОкончанияРабот Тогда
	   ЗаявкаИзменена = Истина;  
	   ИзменилосьВремя = СтрШаблон("Изменилось время проведения работ на: %1 с %2 по %3.", Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yy"), 
			Формат(ВремяНачалаРабот, "ДФ=HH:mm"), Формат(ВремяОкончанияРабот, "ДФ=HH:mm"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И ЗаявкаИзменена Тогда
		НоваяЗапись = Справочники.ВКМ_УведомленияТелеграм_боту.СоздатьЭлемент();
		НоваяЗапись.ТекстСообщения = СтрШаблон("<b>Заявка № %1 от %2 изменена!</b> %3 %4 %5 %6", Номер, Дата, Символы.ВК,  ИзмениласьПроблема,  ИзменилсяСпециалист, ИзменилосьВремя);
		НоваяЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры
